🚀&nbsp; env0 had composed a PR Plan for environment [K8S Agent - KuShield / Kushield EKS Cluster (kushield_eks_cluster)](http://dev.dev.env0.com/p/61eea155-9f3d-429b-9e78-f097be98adf6/environments/6c0d2d52-ba7f-4915-a6cc-d8362dddbeba?organizationId=d9b937bc-3679-445a-b53b-c03eb6fbbb84):
```
Plan: 7 to add, 6 to change, 7 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-   destroy
 <= read (data resources)

OpenTofu will perform the following actions:


  # module.autoscaler.data.aws_eks_node_group.node_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_node_group" "node_group" {
+       ami_type        = (known after apply)
+       arn             = (known after apply)
+       capacity_type   = (known after apply)
+       cluster_name    = "kushield-new"
+       disk_size       = (known after apply)
+       id              = (known after apply)
+       instance_types  = (known after apply)
+       labels          = (known after apply)
+       launch_template = (known after apply)
+       node_group_name = "deployment"
+       node_role_arn   = (known after apply)
+       release_version = (known after apply)
+       remote_access   = (known after apply)
+       resources       = (known after apply)
+       scaling_config  = (known after apply)
+       status          = (known after apply)
+       subnet_ids      = (known after apply)
+       tags            = (known after apply)
+       taints          = (known after apply)
+       version         = (known after apply)
    }

  # module.autoscaler.module.eks-cluster-autoscaler.data.aws_iam_policy_document.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "autoscaling:DescribeAutoScalingGroups",
+               "autoscaling:DescribeAutoScalingInstances",
+               "autoscaling:DescribeLaunchConfigurations",
+               "autoscaling:DescribeScalingActivities",
+               "autoscaling:DescribeTags",
+               "autoscaling:SetDesiredCapacity",
+               "autoscaling:TerminateInstanceInAutoScalingGroup",
+               "ec2:DescribeImages",
+               "ec2:DescribeInstanceTypes",
+               "ec2:DescribeLaunchTemplateVersions",
+               "ec2:GetInstanceTypesFromInstanceRequirements",
+               "eks:DescribeNodegroup",
            ]
+           effect    = "Allow"
+           resources = [
+               "*",
            ]
+           sid       = "Autoscaling"
        }
    }

  # module.autoscaler.module.eks-cluster-autoscaler.data.aws_iam_policy_document.this_irsa[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this_irsa" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRoleWithWebIdentity",
            ]
+           effect  = "Allow"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "system:serviceaccount:cluster-autoscaler:cluster-autoscaler",
                ]
+               variable = "oidc.eks.us-east-1.amazonaws.com/id/552F599E8C96AA4363438C8900259368:sub"
            }

+           principals {
+               identifiers = [
+                   "arn:aws:iam::343806850935:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/552F599E8C96AA4363438C8900259368",
                ]
+               type        = "Federated"
            }
        }
    }

  # module.autoscaler.module.eks-cluster-autoscaler.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
+       description = (known after apply)
+       endpoint    = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
    }

  # module.autoscaler.module.eks-cluster-autoscaler.data.utils_deep_merge_yaml.values[0] will be read during apply
  # (config refers to values not yet known)
 <= data "utils_deep_merge_yaml" "values" {
+       id     = (known after apply)
+       input  = (known after apply)
+       output = (known after apply)
    }

  # module.autoscaler.module.eks-cluster-autoscaler.aws_iam_policy.this[0] will be updated in-place
!   resource "aws_iam_policy" "this" {
        id               = "arn:aws:iam::343806850935:policy/cluster-autoscaler-irsa-cluster-autoscaler"
        name             = "cluster-autoscaler-irsa-cluster-autoscaler"
!       policy           = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "eks:DescribeNodegroup",
-                           "ec2:GetInstanceTypesFromInstanceRequirements",
-                           "ec2:DescribeLaunchTemplateVersions",
-                           "ec2:DescribeInstanceTypes",
-                           "ec2:DescribeImages",
-                           "autoscaling:TerminateInstanceInAutoScalingGroup",
-                           "autoscaling:SetDesiredCapacity",
-                           "autoscaling:DescribeTags",
-                           "autoscaling:DescribeScalingActivities",
-                           "autoscaling:DescribeLaunchConfigurations",
-                           "autoscaling:DescribeAutoScalingInstances",
-                           "autoscaling:DescribeAutoScalingGroups",
                        ]
-                       Effect   = "Allow"
-                       Resource = "*"
-                       Sid      = "Autoscaling"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (6 unchanged attributes hidden)
    }

  # module.autoscaler.module.eks-cluster-autoscaler.aws_iam_role.this[0] will be updated in-place
!   resource "aws_iam_role" "this" {
!       assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRoleWithWebIdentity"
-                       Condition = {
-                           StringEquals = {
-                               "oidc.eks.us-east-1.amazonaws.com/id/552F599E8C96AA4363438C8900259368:sub" = "system:serviceaccount:cluster-autoscaler:cluster-autoscaler"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Federated = "arn:aws:iam::343806850935:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/552F599E8C96AA4363438C8900259368"
                        }
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "cluster-autoscaler-irsa-cluster-autoscaler"
        name                  = "cluster-autoscaler-irsa-cluster-autoscaler"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # module.autoscaler.module.eks-cluster-autoscaler.helm_release.this[0] will be updated in-place
!   resource "helm_release" "this" {
        id                         = "cluster-autoscaler"
!       metadata                   = [
-           {
-               app_version    = "1.27.2"
-               chart          = "cluster-autoscaler"
-               first_deployed = 1714592145
-               last_deployed  = 1725441484
-               name           = "cluster-autoscaler"
-               namespace      = "cluster-autoscaler"
-               notes          = <<-EOT
                    To verify that cluster-autoscaler has started, run:
                    
                      kubectl --namespace=cluster-autoscaler get pods -l "app.kubernetes.io/name=aws-cluster-autoscaler,app.kubernetes.io/instance=cluster-autoscaler"
                EOT
-               revision       = 2
-               values         = jsonencode(
                    {
-                       autoDiscovery = {
-                           clusterName = "kushield-new"
                        }
-                       awsRegion     = "us-east-1"
-                       rbac          = {
-                           create         = true
-                           serviceAccount = {
-                               annotations = {
-                                   "eks.amazonaws.com/role-arn" = "arn:aws:iam::343806850935:role/cluster-autoscaler-irsa-cluster-autoscaler"
                                }
-                               create      = true
-                               name        = "cluster-autoscaler"
                            }
                        }
                    }
                )
-               version        = "9.33.0"
            },
        ] -> (known after apply)
        name                       = "cluster-autoscaler"
!       values                     = [
-           <<-EOT
                autoDiscovery:
                    clusterName: kushield-new
                awsRegion: us-east-1
                rbac:
                    create: true
                    serviceAccount:
                        annotations:
                            eks.amazonaws.com/role-arn: arn:aws:iam::343806850935:role/cluster-autoscaler-irsa-cluster-autoscaler
                        create: true
                        name: cluster-autoscaler
            EOT,
        ] -> (known after apply)
        # (26 unchanged attributes hidden)
    }

  # module.efs_csi_driver.module.efs_csi_role.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
+       account_id = (known after apply)
+       arn        = (known after apply)
+       id         = (known after apply)
+       user_id    = (known after apply)
    }

  # module.efs_csi_driver.module.efs_csi_role.data.aws_iam_policy_document.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRoleWithWebIdentity",
            ]
+           effect  = "Allow"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "sts.amazonaws.com",
                ]
+               variable = "oidc.eks.us-east-1.amazonaws.com/id/552F599E8C96AA4363438C8900259368:aud"
            }
+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "system:serviceaccount:kube-system:efs-csi-controller-sa",
+                   "system:serviceaccount:kube-system:efs-csi-node-sa",
                ]
+               variable = "oidc.eks.us-east-1.amazonaws.com/id/552F599E8C96AA4363438C8900259368:sub"
            }

+           principals {
+               identifiers = [
+                   "arn:aws:iam::343806850935:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/552F599E8C96AA4363438C8900259368",
                ]
+               type        = "Federated"
            }
        }
    }


  # module.efs_csi_driver.module.efs_csi_role.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
+       dns_suffix         = (known after apply)
+       id                 = (known after apply)
+       partition          = (known after apply)
+       reverse_dns_prefix = (known after apply)
    }

  # module.efs_csi_driver.module.efs_csi_role.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
+       description = (known after apply)
+       endpoint    = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
    }

  # module.efs_csi_driver.module.efs_csi_role.aws_iam_role.this[0] will be updated in-place
!   resource "aws_iam_role" "this" {
!       assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRoleWithWebIdentity"
-                       Condition = {
-                           StringEquals = {
-                               "oidc.eks.us-east-1.amazonaws.com/id/552F599E8C96AA4363438C8900259368:aud" = "sts.amazonaws.com"
-                               "oidc.eks.us-east-1.amazonaws.com/id/552F599E8C96AA4363438C8900259368:sub" = [
-                                   "system:serviceaccount:kube-system:efs-csi-controller-sa",
-                                   "system:serviceaccount:kube-system:efs-csi-node-sa",
                                ]
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Federated = "arn:aws:iam::343806850935:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/552F599E8C96AA4363438C8900259368"
                        }
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "kushield-new_AmazonEKS_EFS_CSI_DriverRole"
        name                  = "kushield-new_AmazonEKS_EFS_CSI_DriverRole"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_eks_addon.this["coredns"] will be updated in-place
!   resource "aws_eks_addon" "this" {
!       addon_version               = "v1.12.4-eksbuild.1" -> "v1.12.3-eksbuild.1"
        id                          = "kushield-new:coredns"
        tags                        = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.eks.aws_eks_addon.this["kube-proxy"] will be updated in-place
!   resource "aws_eks_addon" "this" {
!       addon_version               = "v1.34.0-eksbuild.4" -> "v1.34.0-eksbuild.2"
        id                          = "kushield-new:kube-proxy"
        tags                        = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.eks.module.eks_managed_node_group["deployment"].aws_eks_node_group.this[0] will be created
+   resource "aws_eks_node_group" "this" {
+       ami_type               = "AL2_x86_64"
+       arn                    = (known after apply)
+       capacity_type          = "SPOT"
+       cluster_name           = "kushield-new"
+       disk_size              = (known after apply)
+       id                     = (known after apply)
+       instance_types         = [
+           "t3a.2xlarge",
+           "t3a.xlarge",
+           "t3.2xlarge",
+           "t3.xlarge",
        ]
+       node_group_name        = "deployment"
+       node_group_name_prefix = (known after apply)
+       node_role_arn          = (known after apply)
+       release_version        = (known after apply)
+       resources              = (known after apply)
+       status                 = (known after apply)
+       subnet_ids             = [
+           "subnet-0155816bcceb74897",
+           "subnet-0378a55774ddd1c0c",
+           "subnet-0912bfce7c79a4887",
+           "subnet-0d81b8efe2e4c1e0f",
        ]
+       tags                   = {
+           "Name" = "deployment"
        }
+       tags_all               = {
+           "Name" = "deployment"
        }
+       version                = "1.34"

+       launch_template {
+           id      = (known after apply)
+           name    = (known after apply)
+           version = (known after apply)
        }

+       node_repair_config (known after apply)

+       scaling_config {
+           desired_size = 2
+           max_size     = 20
+           min_size     = 2
        }

+       timeouts {}

+       update_config {
+           max_unavailable_percentage = 50
        }
    }

  # module.eks.module.eks.module.eks_managed_node_group["deployment"].aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
+                       Sid       = "EKSNodeAssumeRole"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       description           = "EKS managed node group IAM role"
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "deployment-eks-node-group-"
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.eks.module.eks.module.eks_managed_node_group["deployment"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
+       role       = (known after apply)
    }

  # module.eks.module.eks.module.eks_managed_node_group["deployment"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
+       role       = (known after apply)
    }

  # module.eks.module.eks.module.eks_managed_node_group["deployment"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
+       role       = (known after apply)
    }

  # module.eks.module.eks.module.eks_managed_node_group["deployment"].aws_launch_template.this[0] will be created
+   resource "aws_launch_template" "this" {
+       arn                    = (known after apply)
+       default_version        = (known after apply)
+       description            = "Custom launch template for deployment EKS managed node group"
+       id                     = (known after apply)
+       latest_version         = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "deployment-"
+       tags_all               = (known after apply)
+       update_default_version = true
+       vpc_security_group_ids = [
+           "sg-099bef3be0183ea92",
        ]

+       block_device_mappings {
+           device_name = "/dev/xvda"

+           ebs {
+               delete_on_termination      = "true"
+               iops                       = (known after apply)
+               throughput                 = (known after apply)
+               volume_initialization_rate = (known after apply)
+               volume_size                = 50
+               volume_type                = "gp3"
            }
        }

+       metadata_options {
+           http_endpoint               = "enabled"
+           http_protocol_ipv6          = (known after apply)
+           http_put_response_hop_limit = 2
+           http_tokens                 = "required"
+           instance_metadata_tags      = (known after apply)
        }

+       monitoring {
+           enabled = true
        }

+       tag_specifications {
+           resource_type = "instance"
+           tags          = {
+               "Name" = "deployment"
            }
        }
+       tag_specifications {
+           resource_type = "network-interface"
+           tags          = {
+               "Name" = "deployment"
            }
        }
+       tag_specifications {
+           resource_type = "volume"
+           tags          = {
+               "Name" = "deployment"
            }
        }
    }

  # module.eks.module.eks.module.eks_managed_node_group["deployment_v2"].aws_eks_node_group.this[0] will be destroyed
  # (because module.eks.module.eks.module.eks_managed_node_group["deployment_v2"] is not in configuration)
-   resource "aws_eks_node_group" "this" {
-       ami_type        = "AL2023_x86_64_STANDARD" -> null
-       arn             = "arn:aws:eks:us-east-1:343806850935:nodegroup/kushield-new/deployment_v2/14cd36d6-ef75-bf93-4bd6-2e139d30bb4d" -> null
-       capacity_type   = "SPOT" -> null
-       cluster_name    = "kushield-new" -> null
-       disk_size       = 0 -> null
-       id              = "kushield-new:deployment_v2" -> null
-       instance_types  = [
-           "t3a.2xlarge",
-           "t3a.xlarge",
-           "t3.2xlarge",
-           "t3.xlarge",
        ] -> null
-       labels          = {} -> null
-       node_group_name = "deployment_v2" -> null
-       node_role_arn   = "arn:aws:iam::343806850935:role/deployment_v2-eks-node-group-20251110121136560700000001" -> null
-       release_version = "1.34.1-20251108" -> null
-       resources       = [
-           {
-               autoscaling_groups              = [
-                   {
-                       name = "eks-deployment_v2-14cd36d6-ef75-bf93-4bd6-2e139d30bb4d"
                    },
                ]
-               remote_access_security_group_id = ""
            },
        ] -> null
-       status          = "ACTIVE" -> null
-       subnet_ids      = [
-           "subnet-0155816bcceb74897",
-           "subnet-0378a55774ddd1c0c",
-           "subnet-0912bfce7c79a4887",
-           "subnet-0d81b8efe2e4c1e0f",
        ] -> null
-       tags            = {
-           "Name" = "deployment_v2"
        } -> null
-       tags_all        = {
-           "Name" = "deployment_v2"
        } -> null
-       version         = "1.34" -> null

-       launch_template {
-           id      = "lt-02b0f027dc4d2a934" -> null
-           name    = "deployment_v2-20251110121137005800000005" -> null
-           version = "1" -> null
        }

-       scaling_config {
-           desired_size = 2 -> null
-           max_size     = 20 -> null
-           min_size     = 2 -> null
        }

-       timeouts {}

-       update_config {
-           max_unavailable            = 0 -> null
-           max_unavailable_percentage = 50 -> null
        }
    }

  # module.eks.module.eks.module.eks_managed_node_group["deployment_v2"].aws_iam_role.this[0] will be destroyed
  # (because module.eks.module.eks.module.eks_managed_node_group["deployment_v2"] is not in configuration)
-   resource "aws_iam_role" "this" {
-       arn                   = "arn:aws:iam::343806850935:role/deployment_v2-eks-node-group-20251110121136560700000001" -> null
-       assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "ec2.amazonaws.com"
                        }
-                       Sid       = "EKSNodeAssumeRole"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       create_date           = "2025-11-10T12:11:36Z" -> null
-       description           = "EKS managed node group IAM role" -> null
-       force_detach_policies = true -> null
-       id                    = "deployment_v2-eks-node-group-20251110121136560700000001" -> null
-       managed_policy_arns   = [
-           "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
-           "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
-           "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
        ] -> null
-       max_session_duration  = 3600 -> null
-       name                  = "deployment_v2-eks-node-group-20251110121136560700000001" -> null
-       name_prefix           = "deployment_v2-eks-node-group-" -> null
-       path                  = "/" -> null
-       tags                  = {} -> null
-       tags_all              = {} -> null
-       unique_id             = "AROAVADD4G53VCZDU7TZ3" -> null
    }

  # module.eks.module.eks.module.eks_managed_node_group["deployment_v2"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"] will be destroyed
  # (because module.eks.module.eks.module.eks_managed_node_group["deployment_v2"] is not in configuration)
-   resource "aws_iam_role_policy_attachment" "this" {
-       id         = "deployment_v2-eks-node-group-20251110121136560700000001-20251110121136929800000004" -> null
-       policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly" -> null
-       role       = "deployment_v2-eks-node-group-20251110121136560700000001" -> null
    }

  # module.eks.module.eks.module.eks_managed_node_group["deployment_v2"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"] will be destroyed
  # (because module.eks.module.eks.module.eks_managed_node_group["deployment_v2"] is not in configuration)
-   resource "aws_iam_role_policy_attachment" "this" {
-       id         = "deployment_v2-eks-node-group-20251110121136560700000001-20251110121136884500000002" -> null
-       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy" -> null
-       role       = "deployment_v2-eks-node-group-20251110121136560700000001" -> null
    }

  # module.eks.module.eks.module.eks_managed_node_group["deployment_v2"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be destroyed
  # (because module.eks.module.eks.module.eks_managed_node_group["deployment_v2"] is not in configuration)
-   resource "aws_iam_role_policy_attachment" "this" {
-       id         = "deployment_v2-eks-node-group-20251110121136560700000001-20251110121136895000000003" -> null
-       policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy" -> null
-       role       = "deployment_v2-eks-node-group-20251110121136560700000001" -> null
    }

  # module.eks.module.eks.module.eks_managed_node_group["deployment_v2"].aws_launch_template.this[0] will be destroyed
  # (because module.eks.module.eks.module.eks_managed_node_group["deployment_v2"] is not in configuration)
-   resource "aws_launch_template" "this" {
-       arn                     = "arn:aws:ec2:us-east-1:343806850935:launch-template/lt-02b0f027dc4d2a934" -> null
-       default_version         = 1 -> null
-       description             = "Custom launch template for deployment_v2 EKS managed node group" -> null
-       disable_api_stop        = false -> null
-       disable_api_termination = false -> null
-       id                      = "lt-02b0f027dc4d2a934" -> null
-       latest_version          = 1 -> null
-       name                    = "deployment_v2-20251110121137005800000005" -> null
-       name_prefix             = "deployment_v2-" -> null
-       security_group_names    = [] -> null
-       tags                    = {} -> null
-       tags_all                = {} -> null
-       update_default_version  = true -> null
-       vpc_security_group_ids  = [
-           "sg-099bef3be0183ea92",
        ] -> null

-       block_device_mappings {
-           device_name = "/dev/xvda" -> null

-           ebs {
-               delete_on_termination      = "true" -> null
-               iops                       = 0 -> null
-               throughput                 = 0 -> null
-               volume_initialization_rate = 0 -> null
-               volume_size                = 50 -> null
-               volume_type                = "gp3" -> null
            }
        }

-       metadata_options {
-           http_endpoint               = "enabled" -> null
-           http_put_response_hop_limit = 2 -> null
-           http_tokens                 = "required" -> null
        }

-       monitoring {
-           enabled = true -> null
        }

-       tag_specifications {
-           resource_type = "instance" -> null
-           tags          = {
-               "Name" = "deployment_v2"
            } -> null
        }
-       tag_specifications {
-           resource_type = "network-interface" -> null
-           tags          = {
-               "Name" = "deployment_v2"
            } -> null
        }
-       tag_specifications {
-           resource_type = "volume" -> null
-           tags          = {
-               "Name" = "deployment_v2"
            } -> null
        }
    }

  # module.eks.module.eks.module.eks_managed_node_group["deployment"].module.user_data.null_resource.validate_cluster_service_cidr will be created
+   resource "null_resource" "validate_cluster_service_cidr" {
+       id = (known after apply)
    }

  # module.eks.module.eks.module.eks_managed_node_group["deployment_v2"].module.user_data.null_resource.validate_cluster_service_cidr will be destroyed
  # (because module.eks.module.eks.module.eks_managed_node_group["deployment_v2"].module.user_data is not in configuration)
-   resource "null_resource" "validate_cluster_service_cidr" {
-       id = "2981783870074285114" -> null
    }

Plan: 7 to add, 6 to change, 7 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "helm_values_access_key"
│ but a value was found in file "env0.auto.tfvars.json". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "efs_id" but a value was
│ found in file "env0.auto.tfvars.json". If you meant to use this value, add
│ a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 6 other variable(s)
│ defined without being declared.
╵
```
</details>



To *apply* this plan, use the following comment:
```
env0 apply -e kushield_eks_cluster
```


[Full PR Plan logs on env0](http://dev.dev.env0.com/p/61eea155-9f3d-429b-9e78-f097be98adf6/environments/6c0d2d52-ba7f-4915-a6cc-d8362dddbeba/deployments/37e4a6f5-ff7f-43ab-af49-80cebff63978?organizationId=d9b937bc-3679-445a-b53b-c03eb6fbbb84)

[Get instant insights with AI Summary](http://dev.dev.env0.com/p/61eea155-9f3d-429b-9e78-f097be98adf6/environments/6c0d2d52-ba7f-4915-a6cc-d8362dddbeba/deployments/37e4a6f5-ff7f-43ab-af49-80cebff63978?organizationId=d9b937bc-3679-445a-b53b-c03eb6fbbb84&ai-analyzer=plan-summary)